tap "ankitpokhrel/jira-cli"
tap "bufbuild/buf"
tap "charmbracelet/tap"
tap "chef/chef"
tap "common-fate/granted"
tap "coretech/terrafile"
tap "d12frosted/emacs-plus"
tap "domt4/autoupdate"
tap "dutchcoders/cloudman"
tap "eddieantonio/eddieantonio"
tap "github/bootstrap"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mkchoi212/fac", "https://github.com/mkchoi212/fac.git"
tap "nvie/tap"
tap "romkatv/powerlevel10k"
tap "sachaos/todoist"
tap "terrastruct/d2"
brew "a2ps"
brew "adr-tools"
brew "readline"
brew "xz"
brew "ansible"
brew "black"
brew "pygments"
brew "yamllint"
brew "ansible-lint"
brew "giflib"
brew "libtiff"
brew "apr"
brew "apr-util"
brew "gcc"
brew "boost"
brew "asciidoc"
brew "asciinema"
brew "gettext"
brew "libffi"
brew "python@3.9"
brew "atomicparsley"
brew "autojump"
brew "awk"
brew "node"
brew "aws-cdk"
brew "aws-shell"
brew "docutils"
brew "awscli"
brew "base64"
brew "bash"
brew "bash-completion"
brew "bat"
brew "freetype"
brew "cairo"
brew "harfbuzz"
brew "openjdk@11"
brew "bazel"
brew "protobuf"
brew "bear"
brew "bit-git"
brew "bitwarden-cli"
brew "brew-cask-completion"
brew "bzip2"
brew "checkov"
brew "chezmoi"
brew "clang-format"
brew "cloc"
brew "cmake"
brew "consul"
brew "consul-template"
brew "coreutils"
brew "libidn2"
brew "libssh2"
brew "rtmpdump"
brew "curl"
brew "d2"
brew "dateutils"
brew "delta"
brew "delve"
brew "diffutils"
brew "dive"
brew "docker-completion"
brew "docker-credential-helper"
brew "docker-credential-helper-ecr"
brew "dos2unix"
brew "doxygen"
brew "envconsul"
brew "ghostscript"
brew "exa"
brew "fd"
brew "fribidi"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "leptonica"
brew "sdl2"
brew "tesseract"
brew "x265"
brew "xvid"
brew "zeromq"
brew "ffmpeg"
brew "netpbm"
brew "flake8"
brew "fzf"
brew "gh"
brew "gimme-aws-creds"
brew "gist"
brew "git"
brew "git-extras"
brew "git-filter-repo"
brew "git-quick-stats"
brew "gitleaks"
brew "glow"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "libgcrypt"
brew "libksba"
brew "libusb"
brew "pinentry"
brew "gnupg"
brew "go"
brew "gobject-introspection"
brew "goenv"
brew "golangci-lint"
brew "gopls"
brew "gts"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "grpcurl"
brew "grunt-completion"
brew "gtk+3"
brew "hadolint"
brew "htop"
brew "httpie"
brew "hub"
brew "ical-buddy"
brew "id3lib"
brew "id3v2"
brew "infracost"
brew "iproute2mac"
brew "ipython"
brew "isort"
brew "jfrog-cli"
brew "oniguruma"
brew "jq"
brew "jsonlint"
brew "jsonnet"
brew "pandoc"
brew "jupyterlab"
brew "lastpass-cli"
brew "lftp"
brew "libcaca"
brew "libressl"
brew "libusb-compat"
brew "llvm"
brew "make"
brew "markdownlint-cli"
brew "mas"
brew "md5sha1sum", link: false
brew "micro"
brew "mmark"
brew "mosh"
brew "mplayer"
brew "mtr"
brew "mypy"
brew "ncftp"
brew "neovim"
brew "ocrad"
brew "octave"
brew "openconnect"
brew "openssl@3"
brew "ossp-uuid"
brew "packer"
brew "packer-completion"
brew "parallel"
brew "patchutils"
brew "peco"
brew "percol"
brew "pip-completion"
brew "pipenv"
brew "pipx"
brew "pre-commit"
brew "progress"
brew "protobuf-c"
brew "protoc-gen-go"
brew "protoc-gen-go-grpc"
brew "pth"
brew "pulumi"
brew "pycodestyle"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"
brew "python@3.8"
brew "qemu"
brew "qt"
brew "rake-completion"
brew "rbenv"
brew "rclone"
brew "repo"
brew "ripgrep"
brew "rlwrap"
brew "robot-framework"
brew "ruff"
brew "rust"
brew "semgrep"
brew "shellcheck"
brew "sloccount"
brew "socat"
brew "sonar-scanner"
brew "sphinx-doc"
brew "ssh-copy-id", link: true
brew "sshuttle"
brew "starship"
brew "staticcheck"
brew "subversion"
brew "telnet"
brew "terminal-notifier"
brew "terraform-docs"
brew "tfenv"
brew "tflint"
brew "tfsec"
brew "tig"
brew "tldr"
brew "todo-txt"
brew "tree"
brew "vagrant-completion"
brew "vault"
brew "vim"
brew "wget"
brew "xpdf"
brew "yaegi"
brew "youtube-dl"
brew "zlib"
brew "zoxide"
brew "zsh"
brew "ankitpokhrel/jira-cli/jira-cli"
brew "bufbuild/buf/buf"
brew "charmbracelet/tap/skate"
brew "common-fate/granted/granted"
brew "coretech/terrafile/terrafile"
brew "dutchcoders/cloudman/cloudman"
brew "mkchoi212/fac/fac"
brew "sachaos/todoist/todoist"
cask "aws-vault"
cask "beardedspice"
cask "cakebrew"
cask "devtoys"
cask "dozer"
cask "font-anonymice-powerline"
cask "font-consolas-for-powerline"
cask "font-dejavu-sans-mono-for-powerline"
cask "font-droid-sans-mono-for-powerline"
cask "font-fira-mono-for-powerline"
cask "font-inconsolata-dz-for-powerline"
cask "font-inconsolata-for-powerline"
cask "font-inconsolata-for-powerline-bold"
cask "font-inconsolata-g-for-powerline"
cask "font-juliamono"
cask "font-liberation-mono-for-powerline"
cask "font-menlo-for-powerline"
cask "font-meslo-for-powerline"
cask "font-monofur-for-powerline"
cask "font-noto-mono-for-powerline"
cask "font-powerline-symbols"
cask "font-roboto-mono-for-powerline"
cask "font-sf-mono-for-powerline"
cask "font-source-code-pro-for-powerline"
cask "font-ubuntu-mono-derivative-powerline"
cask "jupyter-notebook-ql"
cask "kdiff3"
cask "lumen"
cask "mactex"
cask "meetingbar"
cask "openconnect-gui"
cask "rectangle"
cask "staruml"
cask "sublime-merge-dev"
cask "sublime-text-dev"
cask "textmate"
cask "vagrant"
cask "vlc"
cask "xquartz"
cask "yt-music"
cask "ytmdesktop-youtube-music"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "AryanAhire.sublime-monokai"
vscode "charliermarsh.ruff"
vscode "cschlosser.doxdocgen"
vscode "DavidAnson.vscode-markdownlint"
vscode "davidbwaters.macos-modern-theme"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "giovdk21.vscode-sublime-merge"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "Grafana.vscode-jsonnet"
vscode "GrapeCity.gc-excelviewer"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "humao.rest-client"
vscode "janjoerke.jenkins-pipeline-linter-connector"
vscode "jeff-hykin.better-cpp-syntax"
vscode "Meezilla.json"
vscode "MellowMarshmallow.groovy"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "PKief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "SonarSource.sonarlint-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "TabNine.tabnine-vscode"
vscode "tadayosi.vscode-makefile-outliner"
vscode "timonwong.shellcheck"
vscode "twxs.cmake"
vscode "vscode-icons-team.vscode-icons"
vscode "withfig.fig"
vscode "ziglang.vscode-zig"
vscode "zxh404.vscode-proto3"
