tap "abhinav/tap"
tap "ankitpokhrel/jira-cli"
tap "bufbuild/buf"
tap "charmbracelet/tap"
tap "common-fate/granted"
tap "coretech/terrafile"
tap "dutchcoders/cloudman"
tap "github/gh"
tap "julien-cpsn/atac"
tap "messense/macos-cross-toolchains"
tap "romkatv/powerlevel10k"
tap "taiki-e/tap"
brew "a2ps"
brew "adr-tools"
brew "age"
brew "openssl@3"
brew "readline"
brew "xz"
brew "ansible@9"
brew "giflib"
brew "libtiff"
brew "boost"
brew "asciidoc"
brew "asciinema"
brew "gettext"
brew "oniguruma"
brew "atac"
brew "atomicparsley"
brew "atuin"
brew "autojump"
brew "awk"
brew "node"
brew "aws-cdk"
brew "aws-shell"
brew "awscli"
brew "bandwhich"
brew "base64"
brew "bash"
brew "bash-completion"
brew "libssh2"
brew "bat"
brew "freetype"
brew "cairo"
brew "harfbuzz"
brew "bazel"
brew "bitwarden-cli"
brew "black"
brew "brew-cask-completion"
brew "bzip2"
brew "cargo-binstall"
brew "gcc"
brew "checkov"
brew "chezmoi"
brew "clang-format"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "rtmpdump"
brew "curl"
brew "d2"
brew "dateutils"
brew "delve"
brew "devcontainer"
brew "difftastic"
brew "diffutils"
brew "dive"
brew "docker-completion"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "docker-credential-helper-ecr"
brew "docutils"
brew "dos2unix"
brew "dotter"
brew "doxygen"
brew "eza"
brew "fd"
brew "fribidi"
brew "libidn2"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "leptonica"
brew "sdl2"
brew "tesseract"
brew "x265"
brew "xvid"
brew "zeromq"
brew "ffmpeg"
brew "figlet"
brew "fish"
brew "fzf"
brew "get_iplayer"
brew "gh"
brew "gimme-aws-creds"
brew "gist"
brew "git"
brew "git-delta"
brew "git-extras"
brew "git-filter-repo"
brew "git-quick-stats"
brew "git-who"
brew "gitleaks"
brew "glow"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "libgcrypt"
brew "libksba"
brew "libusb"
brew "pinentry"
brew "gnupg"
brew "go"
brew "pkgconf"
brew "gobject-introspection"
brew "goenv"
brew "golangci-lint"
brew "gopls"
brew "netpbm"
brew "gts"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "grpcurl"
brew "gtk+3"
brew "hadolint"
brew "htop"
brew "httpie"
brew "hub"
brew "ical-buddy"
brew "id3lib"
brew "id3v2"
brew "infracost"
brew "iproute2mac"
brew "ipython"
brew "isort"
brew "jfrog-cli"
brew "jj"
brew "jless"
brew "jq"
brew "jsonlint"
brew "jsonnet"
brew "pandoc"
brew "jupyterlab"
brew "lftp"
brew "libcaca"
brew "libffi"
brew "libressl"
brew "libusb-compat"
brew "llvm"
brew "make"
brew "markdownlint-cli"
brew "mas"
brew "md5sha1sum", link: true
brew "mdbook"
brew "mergiraf"
brew "micro"
brew "microsocks"
brew "minicom"
brew "mmark"
brew "mole"
brew "mplayer"
brew "mtr"
brew "mypy"
brew "ncftp"
brew "neovim"
brew "nushell"
brew "ocrad"
brew "okta-aws-cli"
brew "ripgrep"
brew "opencode"
brew "openconnect"
brew "openjdk"
brew "openjdk@11"
brew "ossp-uuid"
brew "osv-scanner"
brew "p7zip"
brew "packer-completion"
brew "parallel"
brew "patchutils"
brew "peco"
brew "percol"
brew "pip-completion"
brew "pipenv"
brew "pipx"
brew "plantuml"
brew "pre-commit"
brew "progress"
brew "protobuf"
brew "protobuf-c"
brew "protoc-gen-go"
brew "protoc-gen-go-grpc"
brew "pth"
brew "pulseaudio"
brew "pulumi"
brew "pycodestyle"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"
brew "pygments"
brew "python-packaging"
brew "qemu"
brew "qt"
brew "rage"
brew "rake-completion"
brew "rbenv"
brew "rbw"
brew "rclone"
brew "repo"
brew "rlwrap"
brew "robot-framework"
brew "ruff"
brew "rustup"
brew "scc"
brew "sccache"
brew "semgrep"
brew "shellcheck"
brew "skate"
brew "socat"
brew "sonar-scanner"
brew "sphinx-doc"
brew "ssh-copy-id"
brew "sshuttle"
brew "starship"
brew "staticcheck"
brew "telnet"
brew "terminal-notifier"
brew "terraform-docs"
brew "tfenv"
brew "tflint"
brew "tfsec"
brew "tig"
brew "tldr"
brew "todo-txt"
brew "tokei"
brew "tree"
brew "uv"
brew "vim"
brew "wget"
brew "xpdf"
brew "yaegi"
brew "yamlfmt"
brew "yamllint"
brew "yt-dlp"
brew "zig"
brew "zlib"
brew "zoxide"
brew "zsh"
brew "abhinav/tap/git-spice"
brew "ankitpokhrel/jira-cli/jira-cli"
brew "bufbuild/buf/buf"
brew "common-fate/granted/granted"
brew "coretech/terrafile/terrafile"
brew "dutchcoders/cloudman/cloudman"
brew "messense/macos-cross-toolchains/x86_64-unknown-linux-gnu"
brew "taiki-e/tap/cargo-llvm-cov"
cask "alt-tab"
cask "bartender"
cask "beardedspice"
cask "bitwarden"
cask "doll"
cask "drawio"
cask "firefox"
cask "font-anonymice-powerline"
cask "font-consolas-for-powerline"
cask "font-dejavu-sans-mono-for-powerline"
cask "font-droid-sans-mono-for-powerline"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-for-powerline"
cask "font-inconsolata-dz-for-powerline"
cask "font-inconsolata-for-powerline"
cask "font-inconsolata-for-powerline-bold"
cask "font-inconsolata-g-for-powerline"
cask "font-juliamono"
cask "font-liberation-mono-for-powerline"
cask "font-menlo-for-powerline"
cask "font-meslo-for-powerline"
cask "font-monofur-for-powerline"
cask "font-noto-mono-for-powerline"
cask "font-powerline-symbols"
cask "font-roboto-mono-for-powerline"
cask "font-sf-mono-for-powerline"
cask "font-source-code-pro-for-powerline"
cask "font-ubuntu-mono-derivative-powerline"
cask "funter"
cask "ghostty"
cask "git-credential-manager"
cask "hammerspoon"
cask "iterm2"
cask "jupyter-notebook-ql"
cask "karabiner-elements"
cask "maccy"
cask "meetingbar"
cask "mitmproxy"
cask "monitorcontrol"
cask "notunes"
cask "obsidian"
cask "opencode-desktop"
cask "rectangle"
cask "sublime-merge@dev"
cask "sublime-text@dev"
cask "temurin"
cask "visual-studio-code"
cask "vlc"
cask "yt-music"
cask "zed"
mas "Bitwarden", id: 1352778147
mas "Elisi", id: 1406239881
mas "GoPro Player", id: 1460836908
mas "GoPro Quik", id: 561350520
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Magnet", id: 441258766
mas "Mattermost", id: 1614666244
mas "Microsoft PowerPoint", id: 462062816
mas "Notability", id: 360593530
mas "Numbers", id: 409203825
mas "Okta Extension App", id: 1439967473
mas "Okta Verify", id: 490179405
mas "Pages", id: 409201541
mas "Proxy", id: 0
mas "rcmd", id: 1596283165
mas "Speedtest", id: 1153157709
mas "Tailscale", id: 1475387142
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
mas "Xmind", id: 1327661892
mas "Yubico Authenticator", id: 1497506650
vscode "aryanahire.sublime-monokai"
vscode "atlassian.atlascode"
vscode "charliermarsh.ruff"
vscode "codezombiech.gitignore"
vscode "cschlosser.doxdocgen"
vscode "davidanson.vscode-markdownlint"
vscode "davidbwaters.macos-modern-theme"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "editorconfig.editorconfig"
vscode "fabiospampinato.vscode-diff"
vscode "giovdk21.vscode-sublime-merge"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grafana.vscode-jsonnet"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "humao.rest-client"
vscode "janjoerke.jenkins-pipeline-linter-connector"
vscode "jebbs.plantuml"
vscode "jeff-hykin.better-cpp-syntax"
vscode "joffreykern.markdown-toc"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "mechatroner.rainbow-csv"
vscode "meezilla.json"
vscode "mellowmarshmallow.groovy"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "pdconsec.vscode-print"
vscode "peterj.proto"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "ryanluker.vscode-coverage-gutters"
vscode "solomonkinard.git-blame"
vscode "streetsidesoftware.code-spell-checker"
vscode "swiftlang.swift-vscode"
vscode "tadayosi.vscode-makefile-outliner"
vscode "takumii.markdowntable"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "visualjj.visualjj"
vscode "vscode-icons-team.vscode-icons"
vscode "ziglang.vscode-zig"
go "github.com/maxmind/mm-geofeed-verifier"
go "github.com/lasorda/protobuf-language-server"
cargo "cargo-audit"
cargo "cargo-deps"
cargo "cargo-fuzz"
cargo "cargo-license"
cargo "cargo-llvm-cov"
cargo "cargo-outdated"
cargo "cargo-semver"
cargo "cargo-tarpaulin"
cargo "cargo-udeps"
cargo "cargo-warloc"
cargo "cargo-workspaces"
cargo "cargo-xwin"
cargo "cargo2junit"
cargo "cross"
cargo "gitoxide"
cargo "oxdraw"
cargo "sccache"
