tap "abhinav/tap"
tap "ankitpokhrel/jira-cli"
tap "bufbuild/buf"
tap "charmbracelet/tap"
tap "chef/chef"
tap "common-fate/granted"
tap "coretech/terrafile"
tap "d12frosted/emacs-plus"
tap "domt4/autoupdate"
tap "dutchcoders/cloudman"
tap "eddieantonio/eddieantonio"
tap "github/bootstrap"
tap "github/gh"
tap "messense/macos-cross-toolchains"
tap "mkchoi212/fac", "https://github.com/mkchoi212/fac.git"
tap "nvie/tap"
tap "romkatv/powerlevel10k"
tap "sachaos/todoist"
tap "taiki-e/tap"
tap "terrastruct/d2"
mas "Battery Monitor", id: 836505650
mas "Bitwarden", id: 1352778147
mas "Elisi", id: 1406239881
mas "GoPro Player", id: 1460836908
mas "GoPro Quik", id: 561350520
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Magnet", id: 441258766
mas "Mattermost", id: 1614666244
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Notability", id: 360593530
mas "Okta Extension App", id: 1439967473
mas "Okta Verify", id: 490179405
mas "Proxy", id: 0
mas "Speedtest", id: 1153157709
mas "Tailscale", id: 1475387142
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
mas "Xmind", id: 1327661892
mas "Yubico Authenticator", id: 1497506650
vscode "aryanahire.sublime-monokai"
vscode "atlassian.atlascode"
vscode "charliermarsh.ruff"
vscode "codezombiech.gitignore"
vscode "cschlosser.doxdocgen"
vscode "davidanson.vscode-markdownlint"
vscode "davidbwaters.macos-modern-theme"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "editorconfig.editorconfig"
vscode "fabiospampinato.vscode-diff"
vscode "giovdk21.vscode-sublime-merge"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grafana.vscode-jsonnet"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "humao.rest-client"
vscode "janjoerke.jenkins-pipeline-linter-connector"
vscode "jebbs.plantuml"
vscode "jeff-hykin.better-cpp-syntax"
vscode "joffreykern.markdown-toc"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "mechatroner.rainbow-csv"
vscode "meezilla.json"
vscode "mellowmarshmallow.groovy"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "pdconsec.vscode-print"
vscode "peterj.proto"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "ryanluker.vscode-coverage-gutters"
vscode "solomonkinard.git-blame"
vscode "streetsidesoftware.code-spell-checker"
vscode "swiftlang.swift-vscode"
vscode "tadayosi.vscode-makefile-outliner"
vscode "takumii.markdowntable"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "visualjj.visualjj"
vscode "vscode-icons-team.vscode-icons"
vscode "ziglang.vscode-zig"
